MusicArr = { -- {index,hint1,hint2,Answer,ChatAnswer} 
{1,"매우어려움 캔작해야됨","ㅎㅅ2","마린키우기 향수 2",{
    "노스2","노스텔지아2","노스텔2","노스탈지아2","노스탈2","향수2","향2"
}},
{2,"10주년","ㅎㅅ, ㄴㅅㅌㅈㅇ","마린키우기 향수 Nostalgia",{
    "노스","노스텔지아","노스텔","노스탈지아","노스탈","향수","향수1","향"
}},
{3,"\\\"그 배틀\\\"","ㅎㄹ","마린키우기 힐링",{
    "힐링"
}},
{4,"그의 마개조 맵","ㅇㅇㄷㅌㅌ","마린키우기 Identity",{
    "아이덴티티","아덴","진진짜라","진진자라"
}},
{5,"등산힘들다","ㅈㄹㅅㅁ","마린키우기 쥬림산맥",{
    "쥬림산맥","쥬지산맥","쥬림","쥬지"
}},
{6,"SE보다쉬움","ㅅㄷㅂㄹ","마린키우기 산들바람",{
    "산들바람","산들"
}},
{7,"기억세계","ㅁㅁㄹ","마린키우기 Memory (비욘드 난이도)",{
    "메모리","메모리비욘드","비욘드"
}},
{8,"조합이 주옥같은 맵","ㅁㅅㅁ2","마린키우기 Maximum 2",{
    "맥2","맥시멈2","맥멈2"
}},
{9,"모든 마키맵의 원조","알파뱃 2글자","마린키우기 SE",{
    "se","SE","마키se","마키SE","에스이","오리지널","오리지날"
}},
{10,"힐링 낚으려고 넣었음","숫자2개, 알파뱃 2개","마린키우기 4 VS 4",{
    "44","4vs4","44쌈","4vs4쌈","사사","사사쌈","쌈"
}},
{11,"정식출시 언제?","알파뱃 1개","마린키우기 A",{
    "a","A","에이"
}},
{12,"문제의 근원","알파뱃 1개","마린키우기 N",{
    "n","N","엔"
}},
{13,"동그라미","알파뱃 1개","마린키우기 O",{
    "o","O","오"
}},
{14,"SE인 척 하는 맵","알파뱃 2개","마린키우기 Special Forces Re",{
    "Re","re","리"
}},
{15,"눈물과 분노","알파뱃 1개","마린키우기 S",{
    "s","S","에스"
}},
{16,"힐존에 있으면 무적","알파뱃 1개","마린키우기 W",{
    "w","W","더블유"
}},
{17,"초반부터 센터 부수면 GG","ㄱㄹ","마린키우기 가로",{
    "가로"
}},
{18,"우주 파티","ㄱㄹㅅ","마린키우기 GaLaXy (갤럭시)",{
    "갤럭시","갤","갤1"
}},
{19,"도형 탄막 첫 도입","ㄱㄹㅅㅌ, ㄱㄷㅌ","마린키우기 GaLaXy.2 (갤럭시2)",{
    "갤럭시투","갤2","갤투","갤닷투","갤럭시2"
}},
{20,"드랍버전은 깰려고 하는 맵이 아니다","ㄱㄹㅅㄹㅂㅌ","마린키우기 GaLaXy:ReB∞t (갤럭시3)",{
    "갤럭시리부트","갤리부트","리부트","리붓","갤럭시3","갤3","드랍마키"
}},
{21,"정신나간 막장 브금","ㄱㅇㅇㄷ","마린키우기 Gay World (게이월드)",{
    "게이월드","게이","게월"
}},
{22,"탱크가 너무 아픔","ㄱㄹㅇㅌ","마린키우기 Grate",{
    "grate","그레이트","그레잇"
}},
{23,"SE인척 하는 맵","ㄷㅋㅋ","마린키우기 다크 퀸 (Dark Queen)",{
    "다크퀸","다퀸"
}},
{24,"주주주주죽었어요 짐...","ㄷㅈㅌ","마린키우기 데저트 (Desert)",{
    "데저트","데저"
}},
{25,"겨울에도 죽어나가는 마린들","ㄹㅇㅅㄴㅇ","마린키우기 렛잇 스노우 (Let it Snow)",{
    "렛잇스노우","렛잇","스노우","스노"
}},
{26,"짐","ㄹㅅㅌ","마린키우기 로스트",{
    "로스트"
}},
{27,"공중폭탄 쓸테니 돈좀요","ㄹㅅㄷ","마린키우기 루시드 드림",{
    "루시드드림","루시드"
}},
{28,"??? : 눈이 보였다면 널 죽였겠지?","ㅁㄴㅇㅅ","마린키우기 마녀의 성",{
    "마녀의성","마녀의성1","마성","마성1"
}},
{29,"초창기에 메딕으로 힐해줘야했던 맵","ㅁㄴㅇㅅ2","마린키우기 마녀의 성 2",{
    "마녀의성2","마성2"
}},
{30,"하드코어 어케깸?","ㅁㄴㅇㅅ3","마린키우기 마녀의 성 3",{
    "마녀의성3","마성3"
}},
{31,"마키판의 시초 석육공삼","ㅁㅅㅌㅇㄷㅅ","마린키우기 마스터 에디션",{
    "마스터에디션","마에","마스터"
}},
{32,"벙커링으로 승부한다","ㅁㅇ, (영어10자, 소문자로만 입력)","마린키우기 Mayan Ruins(마야)",{
    "마야","mayanruins","마얀","마얀루인즈","루인"
}},
{33,"8코 국룰","ㅁㅅㅁ3","마린키우기 Maximum 3",{
    "맥시멈3","맥3","맥멈3","maximum3"
}},
{34,"내 모든걸 걸고 만든 건작보스","ㅁㅁㄹ2","마린키우기 Memory 2",{
    "메모리2","메2","memory2"
}},
{35,"석육공삼","ㅁㅅㅇ2","마린키우기 Messiah 2 (메시아2)",{
    "메시아2","messiah2"
}},
{36,"확률주작으로 마린키우기","ㅁㅇㅍㅇㄷ","마린키우기 Maple World(메이플월드)",{
    "메이플월드","메이플"
}},
{37,"집안지키면 터짐","ㅅㅈ","마린키우기 성전",{
    "성전"
}},
{38,"집안지키면 터짐2","ㅅㅈㅅ","마린키우기 성전 속",{
    "성전속"
}},
{39,"탱크키우기","ㅅㄹ","마린키우기 세로",{
    "세로"
}},
{40,"영마만 써도 이김","ㅅㅌ","마린키우기 스타",{
    "스타"
}},
{41,"영마만 쓰면 개빡셈","ㅅㅌ2","마린키우기 스타2",{
    "스타2"
}},
{42,"폭풍","ㅅㅌ","마린키우기 스톰",{
    "스톰"
}},
{43,"원조 갤럭시","ㅅㅍㅇㅅ","마린키우기 스페이스",{
    "스페이스","스페"
}},
{44,"중앙에 왠 탱크가..","ㅅㄱ","마린키우기 시계",{
    "시계"
}},
{45,"엔베깨지마세요","ㅅㅍㅈ","마린키우기 심판자",{
    "심판자","심판"
}},
{46,"제목이 마약이름이더라","ㅇㅅㅌㅅ","마린키우기 Ecstacy(엑스터시)",{
    "엑스터시","엑터"
}},
{47,"이거깨면용자","ㅇㅈㅇㄸ","마린키우기 용자의땅",{
    "용자의땅","용땅","용자"
}},
{48,"풍차","ㅇㄷㅁ","마린키우기 Wind Mill (윈드밀)",{
    "윈드밀","윈밀"
}},
{49,"Red Dog","ㅇㅂㅎ","마린키우기 Evil Hell (이블헬)",{
    "이블헬","이블"
}},
{50,"한계초월","ㅇㄹㅁㅇㅅㄷ,ㅇㅅㄷ","마린키우기 UnLimit ExceeD (언리밋 익시드)",{
    "익시드","언리밋익시드","언리밋"
}},
{51,"초월자","ㅈㄹㅌ","마린키우기 제로투",{
    "제로투","제투","제로"
}},
{52,"강원랜드","ㅈㅇㅋㅈㄴ","마린키우기 Joy Casino (조이 카지노)",{
    "조이카지노","카지노","조이"
}},
{53,"레전드일거같죠? 메딕소리를 잘 들어보세요","ㅋㅇㅅ","마린키우기 Chaos (카오스)",{
    "카오스"
}},
{54,"n단계","ㅋㄷㄹ","마린키우기 Candella (칸델라)",{
    "칸델라","칸델"
}},
{55,"제작자가 여섯살","ㅋㄴㅌ","마린키우기 Connect (커넥트)",{
    "connect","커넥트","커넥"
}},
{56,"12월25일","ㅋㄹㅅㅁㅅ","마린키우기 Christmas (크리스마스)",{
    "클마","크리스마스","클스"
}},
{57,"12월25일 리믹스","ㅋㄹㅅㅁㅅㄹㅁㅅ","마린키우기 Christmas Remix (크리스마스 리믹스)",{
    "클마리믹스","크리스마스리믹스","리믹","클스리믹"
}},
{58,"공방에 자주 보이는 맵","ㅋㄹㅇㅁㅅㄹ, ㅋㅁㄹ","마린키우기 Climax Re (클라이맥스 Re)",{
    "클맥","클맥리","클맥re"
}},
{59,"시나리오 모드","ㅌㅇㅇㄹㅇ","마린키우기 twilight (트와일라잇)",{
    "트왈","트와일라잇","트와일라이트","트와일"
}},
{60,"둠칫둠칫","ㅍㅇㅇㄹㄷ","마린키우기 Palm Island (팜아일랜드)",{
    "파마","팜아일랜드","팜아"
}},
{61,"연대책임제인데...","ㅍㅋㅎㅈㄷ","마린키우기 펑크해저드",{
    "펑크해저드","펑해"
}},
{62,"핵정은으로부터 우리나라를 지켜라","ㅎㅂㄷ","마린키우기 한반도",{
    "반도","한반도"
}},
{63,"여긴 천국이 아니라 지옥임","ㅎㅂ","마린키우기 헤븐",{
    "헤븐"
}},
{64,"시리즈 1인줄 알겠지만 저그가 많이 나옵니다","ㅎㅁ3","마린키우기 희망3",{
    "희망3"
}},
{65,"영마만 써도 깨는 맵","ㅎㅇㄹ","마린키우기 히어로",{
    "히어로"
}},
{66,"PSI가 개깡패임","숫자2개, 알파뱃 2개","마린키우기 4 VS 4",{
    "44","4vs4","44쌈","4vs4쌈","사사","사사쌈","쌈"
}},
{67,"이 브금이 들리면 일단 도망쳐","숫자2개, 알파뱃 2개","마린키우기 4 VS 4",{
    "44","4vs4","44쌈","4vs4쌈","사사","사사쌈","쌈"
}},
{68,"색깔을 잘 보고 피해요","숫자2개, 알파뱃 2개","마린키우기 4 VS 4",{
    "44","4vs4","44쌈","4vs4쌈","사사","사사쌈","쌈"
}},
{69,"월광? 초월?","알파뱃 1개","마린키우기 N",{
    "n","N","엔"
}},
{70,"탄막 끝판왕","알파뱃 1개","마린키우기 N",{
    "n","N","엔"
}},
{71,"이 브금 들으려고 겜하는거지;","알파뱃 1개","마린키우기 N",{
    "n","N","엔"
}},
{72,"우주 클럽","ㄱㄹㅅ","마린키우기 GaLaXy (갤럭시)",{
    "갤럭시","갤","갤1"
}},
{73,"내 첫 탄막보스","ㄱㄹㅅ","마린키우기 GaLaXy (갤럭시)",{
    "갤럭시","갤","갤1"
}},
{74,"누가 감히 기사단에 맞서는가!","ㄱㄹㅅㅌ, ㄱㄷㅌ","마린키우기 GaLaXy.2 (갤럭시2)",{
    "갤럭시투","갤2","갤투","갤닷투","갤럭시2"
}},
{75,"중앙에 몹이 너무 많이나와","ㄱㄹㅅㅌ, ㄱㄷㅌ","마린키우기 GaLaXy.2 (갤럭시2)",{
    "갤럭시투","갤2","갤투","갤닷투","갤럭시2"
}},
{76,"Pink가 좋아할듯","ㄱㅇㅇㄷ","마린키우기 Gay World (게이월드)",{
    "게이월드","게이","게월"
}},
{77,"Pink가 좋아할듯","ㄱㅇㅇㄷ","마린키우기 Gay World (게이월드)",{
    "게이월드","게이","게월"
}},
{78,"썩션?","ㄱㅇㅇㄷ","마린키우기 Gay World (게이월드)",{
    "게이월드","게이","게월"
}},
{79,"전설이 되세요","ㄹㅈㄷ","마린키우기 레전드",{
    "레전","전설","레전드"
}},
{80,"델타","ㄹㅅㄷ","마린키우기 루시드 드림",{
    "루시드드림","루시드"
}},
{81,"성장형","ㅁㄴㅇ","마린키우기 Maniac (매니악)",{
    "매니악"
}},
{82,"이게 왜 이 제목인지 모르겠음","ㅁㄹㅅㅌ","마린키우기 메롱시티",{
    "메롱시티","메롱"
}},
{83,"뭔가 퍼지는데..?","ㅁㅁㄹ2","마린키우기 Memory 2",{
    "메모리2","메2"
}},
{84,"뭔가 퍼지는데..?","ㅁㅁㄹ2","마린키우기 Memory 2",{
    "메모리2","메2"
}},
{85,"뭔가 퍼지는데..?","ㅁㅁㄹ2","마린키우기 Memory 2",{
    "메모리2","메2"
}},
{86,"그놈의 캐리어","ㅁㅁㄹ2","마린키우기 Memory 2",{
    "메모리2","메2"
}},
{87,"스캔뿌리지마세요","ㅁㅁㄹ2","마린키우기 Memory 2",{
    "메모리2","메2"
}},
{88,"서서히 나온다..","ㅁㅁㄹ","마린키우기 Memory (비욘드 난이도)",{
    "메모리","메모리비욘드","비욘드"
}},
{89,"서서히 나온다..","ㅁㅁㄹ","마린키우기 Memory (비욘드 난이도)",{
    "메모리","메모리비욘드","비욘드"
}},
{90,"타노스 ㅅㄱ","ㅁㅁㄹ","마린키우기 Memory (비욘드 난이도)",{
    "메모리","메모리비욘드","비욘드"
}},
{91,"마나조심","ㅁㅁㄹ","마린키우기 Memory (비욘드 난이도)",{
    "메모리","메모리비욘드","비욘드"
}},
{92,"아기상어가 너무 무서웠음","ㅂㅅㄴ","마린키우기 BuSaNy (부사니)",{
    "부사니","부산","busany"
}},
{93,"SE보다쉬움","ㅅㄷㅂㄹ","마린키우기 산들바람",{
    "산들바람","산들"
}},
{94,"SE보다쉬움","ㅅㄷㅂㄹ","마린키우기 산들바람",{
    "산들바람","산들"
}},
{95,"SE보다쉬움","ㅅㄷㅂㄹ","마린키우기 산들바람",{
    "산들바람","산들"
}},
{96,"SE보다쉬움","ㅅㄷㅂㄹ","마린키우기 산들바람",{
    "산들바람","산들"
}},
{97,"버인지 벌인지 몰랐음","ㅅㅂㅇㅂ","마린키우기 서바이벌",{
    "서바이벌","서바","서바이버"
}},
{98,"메롱시티의 첫작","ㅅㅌㄹㅎㄷ","마린키우기 Stronghold",{
    "스트롱홀드","스트롱","스홀"
}},
{99,"엔베깨지마세요","ㅅㅍㅈ","마린키우기 심판자",{
    "심판자","심판"
}},
{100,"데저트인거같지만...","ㅇㅇㄷㅌㅌ","마린키우기 Identity",{
    "아이덴티티","아덴","진진짜라","진진자라"
}},
{101,"슈팅스타를 왜 그따구로 만들어..","ㅇㅇㄷㅌㅌ","마린키우기 Identity",{
    "아이덴티티","아덴","진진짜라","진진자라"
}},
{102,"백엔드, 커세어","ㅇㅇ","마린키우기 Air (에어)",{
    "에어"
}},
{103,"백엔드, 커세어","ㅇㅇ","마린키우기 Air (에어)",{
    "에어"
}},
{104,"백엔드, 커세어","ㅇㅇ","마린키우기 Air (에어)",{
    "에어"
}},
{105,"제작자가 아구라였음??","ㅇㅁㅈ","마린키우기 이매진",{
    "이매진"
}},
{106,"한계초월","ㅇㄹㅁㅇㅅㄷ,ㅇㅅㄷ","마린키우기 UnLimit ExceeD (언리밋 익시드)",{
    "익시드","언리밋익시드","언리밋"
}},
{107,"한계초월","ㅇㄹㅁㅇㅅㄷ,ㅇㅅㄷ","마린키우기 UnLimit ExceeD (언리밋 익시드)",{
    "익시드","언리밋익시드","언리밋"
}},
{108,"한계초월","ㅇㄹㅁㅇㅅㄷ,ㅇㅅㄷ","마린키우기 UnLimit ExceeD (언리밋 익시드)",{
    "익시드","언리밋익시드","언리밋"
}},
{109,"그 파괴자","ㅇㄹㅁㅇㅅㄷ,ㅇㅅㄷ","마린키우기 UnLimit ExceeD (언리밋 익시드)",{
    "익시드","언리밋익시드","언리밋"
}},
{110,"강원랜드","ㅈㅇㅋㅈㄴ","마린키우기 Joy Casino (조이 카지노)",{
    "조이카지노","카지노","조이"
}},
{111,"강원랜드","ㅈㅇㅋㅈㄴ","마린키우기 Joy Casino (조이 카지노)",{
    "조이카지노","카지노","조이"
}},
{112,"강원랜드","ㅈㅇㅋㅈㄴ","마린키우기 Joy Casino (조이 카지노)",{
    "조이카지노","카지노","조이"
}},
{113,"강원랜드","ㅈㅇㅋㅈㄴ","마린키우기 Joy Casino (조이 카지노)",{
    "조이카지노","카지노","조이"
}},
{114,"구버전 등산하기","ㅈㄹㅅㅁ","마린키우기 쥬림산맥",{
    "쥬림산맥","쥬지산맥","쥬림","쥬지"
}},
{115,"시나리오 모드","ㅌㅇㅇㄹㅇ","마린키우기 twilight (트와일라잇)",{
    "트왈","트와일라잇","트와일라이트","트와일"
}},
{116,"끌당","ㅍㅇㅇㄹㄷ","마린키우기 Palm Island (팜아일랜드)",{
    "파마","팜아일랜드","팜아"
}},
{117,"차단제가 너무 짜증남","ㅍㅋㅎㅈㄷㅇ","마린키우기 펑크해저드 WAR",{
    "전쟁","전쟁모드","펑크해저드워","펑크해저드전쟁모드","펑해전쟁모드","war","WAR","펑해워"
}},
{118,"소풍치곤 너무 빡센데?","ㅍㅋㄴ","마린키우기 Picnic (피크닉)",{
    "피크닉"
}},
{119,"매우어려움 캔작해야됨","ㅎㅅ2","마린키우기 향수 2",{
    "노스2","노스텔지아2","노스텔2","노스탈지아2","노스탈2","향수2","향2"
}},
{120,"여긴 천국이 아니라 지옥임","ㅎㅂ","마린키우기 헤븐",{
    "헤븐"
}},
{121,"골럇나오는 건작에서 개털린 기억이..","ㅎㅁ","마린키우기 희망",{
    "희망"
}},
{122,"성장형","ㅁㄴㅇ","마린키우기 Maniac (매니악)",{
    "매니악"
}},
{123,"성장형","ㅁㄴㅇ","마린키우기 Maniac (매니악)",{
    "매니악"
}},
{124,"성장형","ㅁㄴㅇ","마린키우기 Maniac (매니악)",{
    "매니악"
}},
{125,"성장형","ㅁㄴㅇ","마린키우기 Maniac (매니악)",{
    "매니악"
}},

{126,"백엔드, 커세어","ㅇㅇ","마린키우기 Air (에어)",{
    "에어"
}},
{127,"\\\"그 배틀\\\"","ㅎㄹ","마린키우기 힐링",{
    "힐링"
}},
{128,"줄임말이 삼겹살같음","ㄷㅅㅍㄹㄷ","마린키우기 Desperado (데스페라도)",{
    "데스페라도","데페"
}},



}

tarr = {}
AnsArr = {}
AnsArr2 = {}
function Export_MusicSetting()
    
	os.execute("mkdir " .. "MusicSetEPS")
	local CSfile = io.open("MusicSetEPS/MusicSetEPS.txt", "w")
	io.output(CSfile)
	io.write("const MusicHint1 = [")
    io.write("\n")

    for i = 1, #MusicArr do
        io.write("Db(\""..MusicArr[i][2].."\")")
		if i~=#MusicArr then
			io.write(", ")
		end
    end
    io.write("\n")
	io.write("];")
    io.write("\n")
    
	io.write("const MusicHint2 = [")
    io.write("\n")
    for i = 1, #MusicArr do
        io.write("Db(\""..MusicArr[i][3].."\")")
		if i~=#MusicArr then
			io.write(", ")
		end
    end
    io.write("\n")
	io.write("];")
    io.write("\n")

    
	io.write("const MusicLength = [")
    io.write("\n")
    for i = 1, #MusicArr do
        io.write("50")
		if i~=#MusicArr then
			io.write(", ")
		end
    end
    io.write("\n")
	io.write("];")
    io.write("\n")



    
	io.write("const MusicAnswer = [")
    io.write("\n")
    for i = 1, #MusicArr do
        io.write("Db(\""..MusicArr[i][4].."\")")
		if i~=#MusicArr then
			io.write(", ")
		end
    end
    io.write("\n")
	io.write("];")
    io.write("\n\n\n\n\n")

    
    for i = 1, #MusicArr do
        for j,k in pairs(MusicArr[i][5]) do
            if AnsArr[k] == nil then AnsArr[k] = MusicArr[i][1] 
            io.write(k.." : "..(MusicArr[i][1]+1).."\n")
            else
            end
            AnsArr2[i] = AnsArr[k]
        end

    end
    io.write("\n\n\n\n\n")

    for j,k in pairs(AnsArr2) do
        io.write(j.." : "..(k+1).."\n")
    end


    io.write("\n\n\n\n\n")
    for i = 1, #MusicArr do
        if tarr[MusicArr[i][4]]==nil then tarr[MusicArr[i][4]] = true
        io.write(MusicArr[i][4])
        io.write("\n")
        end
    end
	io.close(CSfile)





    
end
Export_MusicSetting()